---
kind: property
id: P:Autodesk.Revit.DB.TessellatedShapeBuilder.LogInteger
source: html/c6a84d2a-824d-07e9-4559-79bb80d25e8e.htm
---
# Autodesk.Revit.DB.TessellatedShapeBuilder.LogInteger Property

Integer value used for logging, if it is performed. Usually
 the number of the face set(s) in the IFC file, from which they
 are imported. Any value is acceptable.

## Syntax (C#)
```csharp
public int LogInteger { get; set; }
```